Model: "sequential_4"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_18 (LSTM)              (None, 4, 50)             12800     
                                                                 
 dropout_18 (Dropout)        (None, 4, 50)             0         
                                                                 
 lstm_19 (LSTM)              (None, 50)                20200     
                                                                 
 dropout_19 (Dropout)        (None, 50)                0         
                                                                 
 dense_4 (Dense)             (None, 1)                 51        
                                                                 
=================================================================
Total params: 33,051
Trainable params: 33,051
Non-trainable params: 0
_________________________________________________________________