Model: "sequential_9"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_32 (LSTM)              (None, 4, 65)             20540     
                                                                 
 dropout_32 (Dropout)        (None, 4, 65)             0         
                                                                 
 lstm_33 (LSTM)              (None, 65)                34060     
                                                                 
 dropout_33 (Dropout)        (None, 65)                0         
                                                                 
 dense_9 (Dense)             (None, 1)                 66        
                                                                 
=================================================================
Total params: 54,666
Trainable params: 54,666
Non-trainable params: 0
_________________________________________________________________