Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm (LSTM)                 (None, 10, 80)            30080     
                                                                 
 dropout (Dropout)           (None, 10, 80)            0         
                                                                 
 lstm_1 (LSTM)               (None, 10, 80)            51520     
                                                                 
 dropout_1 (Dropout)         (None, 10, 80)            0         
                                                                 
 lstm_2 (LSTM)               (None, 80)                51520     
                                                                 
 dropout_2 (Dropout)         (None, 80)                0         
                                                                 
 dense (Dense)               (None, 1)                 81        
                                                                 
=================================================================
Total params: 133,201
Trainable params: 133,201
Non-trainable params: 0
_________________________________________________________________