Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_3 (LSTM)               (None, 9, 75)             26700     
                                                                 
 dropout_3 (Dropout)         (None, 9, 75)             0         
                                                                 
 lstm_4 (LSTM)               (None, 9, 75)             45300     
                                                                 
 dropout_4 (Dropout)         (None, 9, 75)             0         
                                                                 
 lstm_5 (LSTM)               (None, 9, 75)             45300     
                                                                 
 dropout_5 (Dropout)         (None, 9, 75)             0         
                                                                 
 lstm_6 (LSTM)               (None, 9, 75)             45300     
                                                                 
 dropout_6 (Dropout)         (None, 9, 75)             0         
                                                                 
 lstm_7 (LSTM)               (None, 9, 75)             45300     
                                                                 
 dropout_7 (Dropout)         (None, 9, 75)             0         
                                                                 
 lstm_8 (LSTM)               (None, 75)                45300     
                                                                 
 dropout_8 (Dropout)         (None, 75)                0         
                                                                 
 dense_1 (Dense)             (None, 1)                 76        
                                                                 
=================================================================
Total params: 253,276
Trainable params: 253,276
Non-trainable params: 0
_________________________________________________________________