Model: "sequential_6"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_23 (LSTM)              (None, 2, 35)             6860      
                                                                 
 dropout_23 (Dropout)        (None, 2, 35)             0         
                                                                 
 lstm_24 (LSTM)              (None, 35)                9940      
                                                                 
 dropout_24 (Dropout)        (None, 35)                0         
                                                                 
 dense_6 (Dense)             (None, 1)                 36        
                                                                 
=================================================================
Total params: 16,836
Trainable params: 16,836
Non-trainable params: 0
_________________________________________________________________