Model: "sequential_3"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_12 (LSTM)              (None, 2, 20)             2720      
                                                                 
 dropout_12 (Dropout)        (None, 2, 20)             0         
                                                                 
 lstm_13 (LSTM)              (None, 2, 20)             3280      
                                                                 
 dropout_13 (Dropout)        (None, 2, 20)             0         
                                                                 
 lstm_14 (LSTM)              (None, 2, 20)             3280      
                                                                 
 dropout_14 (Dropout)        (None, 2, 20)             0         
                                                                 
 lstm_15 (LSTM)              (None, 2, 20)             3280      
                                                                 
 dropout_15 (Dropout)        (None, 2, 20)             0         
                                                                 
 lstm_16 (LSTM)              (None, 2, 20)             3280      
                                                                 
 dropout_16 (Dropout)        (None, 2, 20)             0         
                                                                 
 lstm_17 (LSTM)              (None, 20)                3280      
                                                                 
 dropout_17 (Dropout)        (None, 20)                0         
                                                                 
 dense_3 (Dense)             (None, 1)                 21        
                                                                 
=================================================================
Total params: 19,141
Trainable params: 19,141
Non-trainable params: 0
_________________________________________________________________